'use strict';

websiteApp.controller('MuseumController',
    function MuseumController($scope) {

        var museums = [{
            id: 1,
            name: "Регионален исторически музей",
            image: "img/museum-SZ.jpeg",
            address: 'бул."Руски" 42',
            worktime: "вторник - неделя, 10.00 - 18.00 ",
            dayoff: "понеделник",
            text: "Регионалният исторически музей в Стара Загора се намира в центъра на града. В неговия фонд се пазят хиляди важни експонати. Витрините на музея проследяват историческите епохи. Районът на Стара Загора е обитаван от най-дълбока древност. Свидетелства за това могат да се видят в първата експозиционна зала на музея. Най-ранните следи от живот са от новокаменната епоха – VI хил. пр.н.е."

        }, {
            id: 2,
            name: "Музей неолитни жилища",
            image: "img/neolit-SZ.jpg",
            address: 'ул. Армейска №20',
            worktime: "вторник – събота 9:00 до 12:30 – 13:00 до 17:30 часа.",
            dayoff: "неделя и понеделник",
            text: "Mузеят „Неолитни жилища” се намира в град Стара Загора и съдържа находки, които са от огромно значение за историята на човечеството. В музея са експонирани две жилища от новокаменната епоха, които се датират от VІ хил. пр. Хр. и са най-добре запазените в Европа от този период. Двете жилища са били внезапно опожарени преди хилядолетия, което е и основната причина да са така добре съхранени. Жилищата са едностайни, с обща преградна стена и общ покрив от слама и шума, построени от дървени колове, преплетени с тънки пръти, обмазани със смес от глина и слама."

        }];

        $scope.museums = museums;
        $scope.hideText = true;
        $scope.showText = showText;

        function showText() {
            if ($scope.hideText === true) {
                $scope.hideText = false;
            } else {
                $scope.hideText = true;
            }
        }
    });
