'use strict';

websiteApp.controller('RomanExcavationsController',
    function romanExcavationsController($scope) {

        var romanExcav = [{
            id: 1,
            name: "Античен форум Августа Траяна",
            image: "img/Antichen-forum.jpg",
            address: 'бул. “Митрополит М.Кусев” 33',
            text: "Форумът на античния римски град Августа Траяна е археологически обект в централната част на град Стара Загора. Обектът е разкрит след строителни работи в района на Съдебната палата в града."

        }, {
            id: 2,
            name: "Късноантичен жилищен дом с мозайка",
            image: "img/home.jpg",
            address: 'бул."Ген. Столетов" №117',
            text: "Гостна зала с многоцветна подова мозайка от богат робовладелски дом. Наподобява пъстър килим с богатата фигурална композиция, организирана около малък декоративен басейн с водоскок. Един от най-добрите образци на римското провинциално изкуство от ІV в. Запазена е от специална защитна постройка под улицата."

        }, {
            id: 3,
            name: "Късноантична обществена сграда",
            image: "img/post-office.jpg",
            address: 'Св. Княз Борис І 81, Централна поща - сутерен',
            text: "Представителна зала, предверие и портици от обществена сграда с многоцветни подови мозайки (ІV - VІ в.). Сградата е разположена в югоизточния край на античния град Августа Траяна, непосредствено до крепостната стена. Мозайката в голямата зала е богата на геометрични форми, плетеници, езически и християнски символи. Основен мотив в изображенията са четирите годишни времена, вечният кръговрат и дървото на живота."
        }];

        $scope.romanExcav = romanExcav;
        $scope.hideText = true;
        $scope.showText = showText;

        function showText() {
            if ($scope.hideText === true) {
                $scope.hideText = false;
            } else {
                $scope.hideText = true;
            }
        }
    });
