'use strict';

newspaperApp.controller('BookDetailController',
    function BookDetailController($scope) {

        var books = [{
            id: 1,
            author: "Иван Дамянов",
            name: "Влакът на детството",
            species: "стихове за деца и възрастни",
            date: "юли 2011 г."
        }, {
            id: 2,
            author: "Николай Семерджиев",
            name: "Предание за Серкангер",
            species: "повест за деца и юноши ",
            date: "декември 2011 г."
        }, {
            id: 3,
            author: "Сиволин Иванов",
            name: "Симфония в бяло",
            species: "стихотворения и епиграми ",
            date: "декември 2011 г."
        }, {
            id: 4,
            author: "Ивка Маринова Сакаджийска",
            name: " Пропуснати блянове ",
            species: "стихотворения ",
            date: "март 2012 г."
        }, {
            id: 5,
            author: "Жана Христова",
            name: " Криле",
            species: "стихотворения ",
            date: "април 2012 г. "
        }, {
            id: 6,
            author: "Маргарита Сапунджиева",
            name: " Бодливо",
            species: "епиграми, стихове, есета  ",
            date: "ноември 2012 г."
        }, {
            id: 7,
            author: "Румен Стоянов",
            name: " Злак",
            species: "стихотворения",
            date: "декември 2012 г."
        }, {
            id: 8,
            author: " Радка Баева",
            name: " Горчиво разсъмване",
            species: "поезия",
            date: "юни 2013 г."
        }, {
            id: 9,
            author: "Литературен клуб \"Димитър Подвързачов\"",
            name: "сборник Цветни акорди",
            species: "поезия и проза",
            date: "юни 2013 г."
        }, {
            id: 10,
            author: "Йорданка Джелепова",
            name: "Кълнове от Роден Чернозем",
            species: "поезия",
            date: "юни 2013 г."
        }, {
            id: 11,
            author: "Kатя Павлова",
            name: "Сърце-жарава",
            species: "стихотворения ",
            date: "август 2013 г."
        }, {
            id: 12,
            author: "Георги Икономов",
            name: "Пегасе мой",
            species: "стихотворения",
            date: "ноември 2013 г."
        }, {
            id: 13,
            author: "Иван Дамянов",
            name: "Декор на самотата",
            species: "опит за роман ",
            date: "декември 2013 г."
        }, {
            id: 14,
            author: "Даниел Александров ",
            name: "От библията на един скитник",
            species: "стихотворения",
            date: "декември 2013 г."
        }, {
            id: 15,
            author: "Георги Икономов",
            name: "Най",
            species: "стихотворения",
            date: "декември 2013 г."
        }, {
            id: 16,
            author: "Георги Икономов",
            name: "Началото на всички начала",
            species: "стихотворения",
            date: "март 2014 г."
        }, {
            id: 17,
            author: "Георги Икономов",
            name: "Камбана",
            species: "стихотворения",
            date: "април 2014 г."
        }, {
            id: 18,
            author: "Георги Икономов",
            name: "Дявол",
            species: "стихотворения",
            date: "април 2014 г."
        }, {
            id: 19,
            author: "Сиволин Иванов",
            name: "Хляб от лимец",
            species: "стихотворения",
            date: "юли 2014 г."
        }, {
            id: 20,
            author: "Иван Дамянов ",
            name: "Крадецът на шамот",
            species: "проза - фейлетони и житейски истории",
            date: "юли 2014 г."
        }, {
            id: 21,
            author: "Виолета Бончева",
            name: "В пъпа на луната",
            species: "поезия, на български и испански, второ електронно издание",
            date: "юли 2014 г."
        }, {
            id: 22,
            author: "Жеко Калъчев",
            name: "Денят се ражда в полето",
            species: "стихове, афоризми, хайку",
            date: "октомври 2014 г."
        }, {
            id: 23,
            author: "Снежана Алексиева",
            name: "Искрици - поезия и публицистика",
            species: "стихотворения и есета",
            date: "октомври 2014 г."
        }, {
            id: 24,
            author: "Надежда Атанасова Радева",
            name: " Не жена",
            species: "Лирика",
            date: "септември 2014 г."
        }, {
            id: 25,
            author: "Йордан Атанасов",
            name: " Пясъчни видения",
            species: "Проза - разкази, новели, пътеписи",
            date: "януари 2015 г."
        }, {
            id: 26,
            author: "Белин Мартинов",
            name: " Колоратурна симфония",
            species: "Стихотворения",
            date: "август 2015 г."
        }, {
            id: 27,
            author: "Кристина Божанова",
            name: "Във ъгълчето на усмивката",
            species: "Стихотворения",
            date: "септември 2015 г."
        }, {
            id: 28,
            author: "Иван Дамянов",
            name: "Любовен експрес",
            species: "проза и стихотворения",
            date: "октомври 2015 г."
        }];

        $scope.books = books;
    });
